## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # random_pet.aims will be created
  + resource "random_pet" "aims" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "gmaims"
        # (1 unchanged attribute hidden)
    }

  # module.azure_ai_multi_service.azurerm_cognitive_account.aoai_account will be created
  + resource "azurerm_cognitive_account" "aoai_account" {
      + custom_subdomain_name              = (known after apply)
      + endpoint                           = (known after apply)
      + id                                 = (known after apply)
      + kind                               = "CognitiveServices"
      + local_auth_enabled                 = true
      + location                           = "eastus2"
      + name                               = (known after apply)
      + outbound_network_access_restricted = false
      + primary_access_key                 = (sensitive value)
      + public_network_access_enabled      = true
      + resource_group_name                = "rg-hot-hornet"
      + secondary_access_key               = (sensitive value)
      + sku_name                           = "S0"
    }

  # module.azure_openai_deployment_embedding.azurerm_cognitive_deployment.aoai_deployment will be updated in-place
  ~ resource "azurerm_cognitive_deployment" "aoai_deployment" {
        id                         = "/subscriptions/a2b47c47-f61e-492e-9529-9ff0c74be671/resourceGroups/rg-hot-hornet/providers/Microsoft.CognitiveServices/accounts/gmcoacequalstingray/deployments/text-embedding-3-small"
        name                       = "text-embedding-3-small"
        # (4 unchanged attributes hidden)

      ~ model {
            name    = "text-embedding-3-small"
          - version = "1" -> null
            # (1 unchanged attribute hidden)
        }

      ~ sku {
          ~ capacity = 8 -> 20
            name     = "Standard"
            # (3 unchanged attributes hidden)
        }
    }

  # module.azure_openai_deployment_gpt.azurerm_cognitive_deployment.aoai_deployment will be updated in-place
  ~ resource "azurerm_cognitive_deployment" "aoai_deployment" {
        id                         = "/subscriptions/a2b47c47-f61e-492e-9529-9ff0c74be671/resourceGroups/rg-hot-hornet/providers/Microsoft.CognitiveServices/accounts/gmcoacequalstingray/deployments/gpt-4o-mini"
        name                       = "gpt-4o-mini"
        # (4 unchanged attributes hidden)

      ~ sku {
          ~ capacity = 8 -> 4
            name     = "Standard"
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```
</details>